#### Terraform Plan

<details><summary>Show plan output</summary>

```
hcloud_ssh_key.default: Refreshing state... [id=108146632]
hcloud_firewall.coolify: Refreshing state... [id=10593149]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.trading will be created
  + resource "hcloud_server" "trading" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = [
          + 10593149,
        ]
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-24.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "managed" = "terraform"
          + "purpose" = "trading-agent"
        }
      + location                   = "nbg1"
      + name                       = "trading-prod"
      + primary_disk_size          = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx33"
      + shutdown_before_deletion   = false
      + ssh_keys                   = [
          + "108146632",
        ]
      + status                     = (known after apply)
      + user_data                  = "XppZv1Apt9HJJXj+slnziFrJXWs="
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + coolify_url = (known after apply)
  + server_ip   = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```

</details>